#การสร้างคลาส

#เราจะทำการสร้างclass employeeสำหรับเก็บข้อมูลพนักงาน โดยมีพนักงานบัญชี ,โปรแกรมเมอร์ ,พนักงานขา 
# และจะมีคุณสมบัติต่างๆเพิ่มเติมตามต้องการและจะมีmethodต่างๆเพิ่มเติมตามต้องการหรือเรียกว่า functions ต่าง ๆ

#พนักงาน มี ชื่อ ,เงินเดือน 
class Employee: #สร้างคลาส ชื่อEmployee 
    pass

#ตั้งชื่อคลาส ต้องเป็นตัวพิมพ์ใหญ่ เพื่อแยกออกจาก class อื่นๆ  เช่น การสร้าง function คือ def employee มันจะถือว่าเป็น function ไม่เป็นคลาส


#การสร้าง วัตถุ หรือ object จากคลาส Employee
emp1 = Employee()  #สร้างวัตถุ ชื่อemp1 จากคลาส Employee
emp2 = Employee()  #สร้างวัตถุ ชื่อemp2 จากคลาส Employee